clear all;
GQstep=[28.5 32 10];%分别为第一，二，三个几何量化步长。
CQstep=[11.25 36 28.5];%分别为第一，二，三个颜色量化步长。
GeoBits=[20321.812955 18433.827326 50425.713264]; %分别为第一，二，三个几何码率。
ColBits=[107731.270602 30940.968372 39024.479658]; %分别为第一，二，三个颜色码率。
Dist=[0.0000512777626483993 0.000108297290694604 0.0000871595050559198];%分别为第一，二，三个总的均一化的失真。
TarRate=[62000 64000 66000 68000 70000];%所有的目标码率。eg. TargetRate = linspace(62000,690000,315)
[OptimalQP,Model] = TMM_convex_method(GQstep,CQstep,GeoBits,ColBits,Dist,TarRate);%调用TMM代码求取目标码率下最有的几何和颜色QP